In [3]:
import pandas as pd
import os

In [4]:
path = "data"

franchise_loc = pd.read_csv(os.path.join(path, "franchise_location.csv"))

franchise_loc.head()

  franchise    title   longitude   latitude
0    바나나테이블   바나나테이블  127.141564  37.474817
1   짚신매운갈비찜  짚신매운갈비찜  126.836944  37.555472
2   짚신매운갈비찜  짚신매운갈비찜  126.907737  37.517580
3   짚신매운갈비찜  짚신매운갈비찜  127.022877  37.518056
4   짚신매운갈비찜  짚신매운갈비찜  127.030554  37.494899

In [5]:
kiosk_loc = pd.read_csv(os.path.join(path, "kiosk_locations_geocoded.csv"))

kiosk_loc.head()

,MGTNO,OPNSFTEAMNM,KIOSKNM,ESBPLCADDR,longitude,latitude
0,521,서울특별시 종로구,LA영사관1번,"서울특별시 종로구 종로1길 36, 종로구청 (수송동)",126.978988,37.573505
1,520,서울특별시 종로구,평창동 주민센터,"서울특별시 종로구 평창문화로 65, 평창동 주민센터 (평창동)",126.968396,37.606360
2,519,서울특별시 종로구,재외동포청,"서울특별시 종로구 율곡로 6, 트윈 트리 빌딩 15층 (중학동)",NaN,NaN
3,513,서울특별시 종로구,사직동 주민센터,서울특별시 종로구 사직로9길 1(사직동)[서울특별시 종로구 사직동 1번지 28호],126.968851,37.576170
4,512,서울특별시 종로구,숭인2동 주민센터,서울특별시 종로구 종로65길 10(숭인동)[서울특별시 종로구 숭인동 10번지],127.019973,37.574855

In [6]:
supermarket_loc = pd.read_csv(os.path.join(path, "supermarket_location.csv"))

supermarket_loc.head()

  market        title   longitude   latitude
0    이마트  풍국면천호점(이마트)  127.125150  37.538726
1    이마트          이마트  126.815118  37.554006
2    이마트          이마트  127.062991  37.648541
3    이마트          이마트  126.980551  37.484462
4    이마트          이마트  126.946135  37.556234

In [7]:
theater_loc = pd.read_csv(os.path.join(path, "theater_location.csv"))

theater_loc.head()

  theater title   longitude   latitude
0     cgv   CGV  126.922650  37.556506
1     cgv   CGV  127.030722  37.612069
2     cgv   CGV  126.890227  37.507044
3     cgv   CGV  126.940328  37.556564
4     cgv   CGV  127.124352  37.478033

In [8]:
bank_loc = pd.read_csv(os.path.join(path, "bank_location.csv"))

bank_loc.head()

   bank                       title   longitude   latitude
0  우리은행                 우리은행(대치북지점)  127.055921  37.502409
1  우리은행    나라빌딩뿌리와새싹치과의원,우리은행(삼풍지점)  127.015712  37.495048
2  우리은행  주한가봉공화국대사관,우리은행(한남동),송가한의원  126.999727  37.536377
3  우리은행                  우리은행,A.T.M  127.015071  37.578896
4  우리은행          월전미술관,우리은행(삼청동영업점)  126.981478  37.583059